Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ويصنع الفلك وكلما مر عليه ملأ من قومه سخروا منه قال إن تسخروا منا فإنا نسخر منكم كما تسخرون
en: And as he was constructing the ship, whenever the chiefs of his people passed by him, they mocked at him. He said: "If you mock at us, so do we mock at you likewise for your mocking.

source: فسوف تعلمون من يأتيه عذاب يخزيه ويحل عليه عذاب مقيم
en: "And you will know who it is on whom will come a torment that will cover him with disgrace and on whom will fall a lasting torment."

source: حتى إذا جاء أمرنا وفار التنور قلنا احمل فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول ومن آمن وما آمن معه إلا قليل
en: (So it was) till when Our Command came and the oven gushed forth (water like fountains from the earth). We said: "Embark therein, of each kind two (male and female), and your family - except him against whom the Word has already gone forth - and those who believe. And none believed with him, except a few."

source: وقال اركبوا فيها بسم الله مجراها ومرساها إن ربي لغفور رحيم
en: And he [Nuh (Noah) عليه السلام] said: "Embark therein: in the Name of Allah will be its (moving) course and its (resting) anchorage. Surely, my Lord is Oft-Forgiving, Most Merciful." (Tafsir At-Tabari)

source: وهي تجري بهم في موج كالجبال ونادى نوح ابنه وكان في معزل يا بني اركب معنا ولا تكن مع الكافرين
en: So it (the ship) sailed with them amidst waves like mountains, and Nuh (Noah) called out to his son, who had separated himself (apart): "O my son! Embark with us and be not with the disbelievers."

source: قال سآوي إلى جبل يعصمني من الماء قال لا عاصم اليوم من أمر الله إلا من رحم وحال بينهما الموج فكان من المغرقين
en: (The son) replied: "I will betake myself to some mountain; it will save me from the water." Nuh (Noah) said: "This day there is no saviour from the Decree of Allah except him on whom He has mercy." And waves came in between them, so he (the son) was among the drowned.

source: وقيل يا أرض ابلعي ماءك ويا سماء أقلعي وغيض الماء وقضي الأمر واستوت على الجودي وقيل بعدا للقوم الظالمين
en: And it was said: "O earth! Swallow up your water, and O sky! Withhold (your rain)." And the water was made to subside and the Decree (of Allah) was fulfilled (i.e. the destruction of the people of Nuh (Noah). And it (the ship) rested on (Mount) Judi, and it was said: "Away with the people who are Zalimun (polytheists and wrong-doers)!"

source: ونادى نوح ربه فقال رب إن ابني من أهلي وإن وعدك الحق وأنت أحكم الحاكمين
en: And Nuh (Noah) called upon his Lord and said, "O my Lord! Verily, my son is of my family! And certainly, Your Promise is true, and You are the Most Just of the judges."

source: قال يا نوح إنه ليس من أهلك إنه عمل غير صالح فلا تسألن ما ليس لك به علم إني أعظك أن تكون من الجاهلين
en: He said: "O Nuh (Noah)! Surely, he is not of your family; verily, his work is unrighteous, so ask not of Me that of which you have no knowledge! I admonish you lest you should be one of the ignorant."

source: قال رب إني أعوذ بك أن أسألك ما ليس لي به علم وإلا تغفر لي وترحمني أكن من الخاسرين
en: Nuh (Noah) said: "O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I will indeed be one of the losers."

source: قيل يا نوح اهبط بسلام منا وبركات عليك وعلى أمم ممن معك وأمم سنمتعهم ثم يمسهم منا عذاب أليم
en: It was said: "O Nuh (Noah)! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you (and on some of their off-spring), but (there will be other) people to whom We shall grant their pleasures (for a time), but in the end a painful torment will reach them from Us."

source: تلك من أنباء الغيب نوحيها إليك ما كنت تعلمها أنت ولا قومك من قبل هذا فاصبر إن العاقبة للمتقين
en: This is of the news of the Unseen which We reveal unto you (O Muhammad صلى الله عليه و سلم); neither you nor your people knew it before this. So be patient. Surely, the (good) end is for Al-Muttaqun (the pious - See V.2:2)

source: وإلى عاد أخاهم هودا قال يا قوم اعبدوا الله ما لكم من إله غيره إن أنتم إلا مفترون
en: And to 'Ad (people We sent) their brother Hud. He said, "O my people! Worship Allah! You have no other ilah (god) but Him. Certainly, you do nothing but invent lies!

source: يا قوم لا أسألكم عليه أجرا إن أجري إلا على الذي فطرني أفلا تعقلون
en: "O my people I ask of you no reward for it (the Message). My reward is only from Him Who created me. Will you not then understand?

source: ويا قوم استغفروا ربكم ثم توبوا إليه يرسل السماء عليكم مدرارا ويزدكم قوة إلى قوتكم ولا تتولوا مجرمين
en: "And O my people! Ask forgiveness of your Lord and then repent to Him, He will send you (from the sky) abundant rain, and add strength to your strength, so do not turn away as Mujrimun (criminals, disbelievers in the Oneness of Allah)."

source: قالوا يا هود ما جئتنا ببينة وما نحن بتاركي آلهتنا عن قولك وما نحن لك بمؤمنين
en: They said: "O Hud! No evidence have you brought us, and we shall not leave our gods for your (mere) saying! And we are not believers in you.

source: إن نقول إلا اعتراك بعض آلهتنا بسوء قال إني أشهد الله واشهدوا أني بريء مما تشركون
en: "All that we say is that some of our gods (false deities) have seized you with evil (madness)." He said: "I call Allah to witness and bear you witness that I am free from that which you ascribe as partners in worship,

source: من دونه فكيدوني جميعا ثم لا تنظرون
en: With Him (Allah). So plot against me, all of you, and give me no respite.

source: إني توكلت على الله ربي وربكم ما من دابة إلا هو آخذ بناصيتها إن ربي على صراط مستقيم
en: "I put my trust in Allah, my Lord and your Lord! There is not a moving (living) creature but He has the grasp of its forelock. Verily, my Lord is on the Straight Path (the truth).

source: فإن تولوا فقد أبلغتكم ما أرسلت به إليكم ويستخلف ربي قوما غيركم ولا تضرونه شيئا إن ربي على كل شيء حفيظ
en: "So if you turn away, still I have conveyed the Message with which I was sent to you. My Lord will make another people succeed you, and you will not harm Him in the least. Surely, my Lord is Guardian over all things."

source: ولما جاء أمرنا نجينا هودا والذين آمنوا معه برحمة منا ونجيناهم من عذاب غليظ
en: And when Our Commandment came, We saved Hud and those who believed with him by a Mercy from Us, and We saved them from a severe torment.

source: وتلك عاد جحدوا بآيات ربهم وعصوا رسله واتبعوا أمر كل جبار عنيد
en: Such were 'Ad (people). They rejected the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord and disobeyed His Messengers, and followed the command of every proud obstinate (oppressor of the truth, from their leaders).

source: وأتبعوا في هذه الدنيا لعنة ويوم القيامة ألا إن عادا كفروا ربهم ألا بعدا لعاد قوم هود
en: And they were pursued by a curse in this world and (so they will be) on the Day of Resurrection. No doubt! Verily, 'Ad disbelieved in their Lord. So away with 'Ad, the people of Hud.

source: وإلى ثمود أخاهم صالحا قال يا قوم اعبدوا الله ما لكم من إله غيره هو أنشأكم من الأرض واستعمركم فيها فاستغفروه ثم توبوا إليه إن ربي قريب مجيب
en: And to Thamud (people We sent) their brother Salih. He said: "O my people! Worship Allah: you have no other ilah (god) but Him. He brought you forth from the earth and settled you therein, then ask forgiveness of Him and turn to Him in repentance. Certainly, my Lord is Near (to all by His Knowledge), Responsive."

source: قالوا يا صالح قد كنت فينا مرجوا قبل هذا أتنهانا أن نعبد ما يعبد آباؤنا وإننا لفي شك مما تدعونا إليه مريب
en: They said: "O Salih! You have been among us as a figure of good hope (and we wished for you to be our chief) till this [new thing which you have brought that we leave our gods and worship your God (Allah) Alone]! Do you (now) forbid us the worship of what our fathers have worshipped? But we are really in grave doubt as to that to which you invite us (monotheism)."

source: قال يا قوم أرأيتم إن كنت على بينة من ربي وآتاني منه رحمة فمن ينصرني من الله إن عصيته فما تزيدونني غير تخسير
en: He said: "O my people! Tell me, if I have a clear proof from my Lord, and there has come to me a Mercy (Prophethood) from Him, who then can help me against Allah, if I were to disobey Him? Then you increase me not but in loss.

source: ويا قوم هذه ناقة الله لكم آية فذروها تأكل في أرض الله ولا تمسوها بسوء فيأخذكم عذاب قريب
en: "And O my people! This she-camel of Allah is a sign to you, so leave her to feed (graze) in Allah's land, and touch her not with evil, lest a near torment should seize you."

source: فعقروها فقال تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب
en: But they killed her. So he said: "Enjoy yourselves in your homes for three days. This is a promise (i.e. a threat) that will not be belied."

source: فلما جاء أمرنا نجينا صالحا والذين آمنوا معه برحمة منا ومن خزي يومئذ إن ربك هو القوي العزيز
en: So when Our Commandment came, We saved Salih and those who believed with him by a Mercy from Us, and from the disgrace of that Day. Verily, your Lord - He is the All-Strong, the All-Mighty.

source: وأخذ الذين ظلموا الصيحة فأصبحوا في ديارهم جاثمين
en: And As-Saihah (torment - awful cry) overtook the wrong-doers, so they lay (dead), prostrate in their homes,

source: كأن لم يغنوا فيها ألا إن ثمود كفروا ربهم ألا بعدا لثمود
en: As if they had never lived there. No doubt! Verily, Thamud disbelieved in their Lord. So away with Thamud!

source: ولقد جاءت رسلنا إبراهيم بالبشرى قالوا سلاما قال سلام فما لبث أن جاء بعجل حنيذ
en: And verily, there came Our messengers to Ibrahim (Abraham) with glad tidings. They said: Salam (greetings or peace!) He answered, Salam (greetings or peace!) and he hastened to entertain them with a roasted calf.

source: فلما رأى أيديهم لا تصل إليه نكرهم وأوجس منهم خيفة قالوا لا تخف إنا أرسلنا إلى قوم لوط
en: But when he saw their hands went not towards it (the meal), he mistrusted them, and conceived a fear of them. They said: "Fear not, we have been sent against the people of Lut (Lot)."

source: وامرأته قائمة فضحكت فبشرناها بإسحاق ومن وراء إسحاق يعقوب
en: And his wife was standing (there), and she laughed [either, because the messengers did not eat their food or for being glad for the destruction of the people of Lut (Lot)]. But We gave her glad tidings of Ishaq (Isaac), and after Ishaq, of Ya'qub (Jacob).

source: قالت يا ويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب
en: She said (in astonishment): "Woe unto me! Shall I bear a child while I am an old woman, and here is my husband an old man? Verily! This is a strange thing!"

source: قالوا أتعجبين من أمر الله رحمت الله وبركاته عليكم أهل البيت إنه حميد مجيد
en: They said: "Do you wonder at the Decree of Allah? The Mercy of Allah and His Blessings be on you, O the family [of Ibrahim (Abraham)]. Surely, He (Allah) is All-Praiseworthy, All-Glorious."

source: فلما ذهب عن إبراهيم الروع وجاءته البشرى يجادلنا في قوم لوط
en: Then when the fear had gone away from (the mind of) Ibrahim (Abraham), and the glad tidings had reached him, he began to plead with Us (Our messengers) for the people of Lut (Lot).

source: إن إبراهيم لحليم أواه منيب
en: Verily, Ibrahim (Abraham) was, without doubt, forbearing, used to invoking Allah with humility, and was repentant (to Allah all the time, again and again).

source: يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود
en: "O Ibrahim (Abraham)! Forsake this. Indeed, the Commandment of your Lord has gone forth. Verily, there will come a torment for them which cannot be turned back."

source: ولما جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقال هذا يوم عصيب
en: And when Our messengers came to Lut (Lot), he was grieved on account of them and felt himself straitened for them (lest the town people should approach them to commit sodomy with them). He said: "This is a distressful day."

source: وجاءه قومه يهرعون إليه ومن قبل كانوا يعملون السيئات قال يا قوم هؤلاء بناتي هن أطهر لكم فاتقوا الله ولا تخزون في ضيفي أليس منكم رجل رشيد
en: And his people came rushing towards him, and since aforetime they used to commit crimes (sodomy), he said: "O my people! Here are my daughters (i.e. the women of the nation), they are purer for you (if you marry them lawfully). So fear Allah and degrace me not with regard to my guests! Is there not among you a single right-minded man?"

source: قالوا لقد علمت ما لنا في بناتك من حق وإنك لتعلم ما نريد
en: They said: "Surely you know that we have neither any desire nor need of your daughters, and indeed you know well what we want!"

source: قال لو أن لي بكم قوة أو آوي إلى ركن شديد
en: He said: "Would that I had strength (men) to overpower you, or that I could betake myself to some powerful support (to resist you)."

source: قالوا يا لوط إنا رسل ربك لن يصلوا إليك فأسر بأهلك بقطع من الليل ولا يلتفت منكم أحد إلا امرأتك إنه مصيبها ما أصابهم إن موعدهم الصبح أليس الصبح بقريب
en: They (messengers) said: "O Lut (Lot)! Verily, we are the messengers from your Lord! They shall not reach you! So travel with your family in a part of the night, and let not any of you look back; but your wife (will remain behind), verily, the punishment which will afflict them, will afflict her. Indeed, morning is their appointed time. Is not the morning near?"

source: فلما جاء أمرنا جعلنا عاليها سافلها وأمطرنا عليها حجارة من سجيل منضود
en: So when Our Commandment came, We turned (the towns of Sodom in Palestine) upside down, and rained on them stones of baked clay, in a well-arranged manner one after another;

source: مسومة عند ربك وما هي من الظالمين ببعيد
en: Marked from your Lord; and they are not ever far from the Zalimun (polytheists, evil-doers).

source: وإلى مدين أخاهم شعيبا قال يا قوم اعبدوا الله ما لكم من إله غيره ولا تنقصوا المكيال والميزان إني أراكم بخير وإني أخاف عليكم عذاب يوم محيط
en: And to the Madyan (Midian) people (We sent) their brother Shu'aib. He said: "O my people! Worship Allah, you have no other ilah (god) but Him, and give not short measure or weight. I see you in prosperity and verily I fear for you the torment of a Day encompassing.

source: ويا قوم أوفوا المكيال والميزان بالقسط ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: "And O my people! Give full measure and weight in justice and reduce not the things that are due to the people, and do not commit mischief in the land, causing corruption.

source: بقيت الله خير لكم إن كنتم مؤمنين وما أنا عليكم بحفيظ
en: "That which is left by Allah for you (after giving the rights of the people) is better for you, if you are believers. And I am not a guardian over you.

source: قالوا يا شعيب أصلاتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء إنك لأنت الحليم الرشيد
en: They said: "O Shu'aib! Does your Salat (prayer) command that we give up what our fathers used to worship, or that we give up doing what we like with our property? Verily, you are the forbearer, right-minded!" (They said this sarcastically).

source: قال يا قوم أرأيتم إن كنت على بينة من ربي ورزقني منه رزقا حسنا وما أريد أن أخالفكم إلى ما أنهاكم عنه إن أريد إلا الإصلاح ما استطعت وما توفيقي إلا بالله عليه توكلت وإليه أنيب
en: He said: "O my people! Tell me if I have a clear evidence from my Lord and He has given me a good sustenance from Himself (shall I corrupt it by mixing it with the unlawfully earned money). I wish not, in contradiction to you, to do that which I forbid you. I only desire reform to the best of my power. And my guidance cannot come except from Allah, in Him I trust and unto Him I repent.

source: ويا قوم لا يجرمنكم شقاقي أن يصيبكم مثل ما أصاب قوم نوح أو قوم هود أو قوم صالح وما قوم لوط منكم ببعيد
en: "And O my people! Let not my Shiqaq cause you to suffer the fate similar to that of the people of Nuh (Noah) or of Hud or of Salih, and the people of Lut (Lot) are not far off from you!

source: واستغفروا ربكم ثم توبوا إليه إن ربي رحيم ودود
en: "And ask forgiveness of your Lord and turn unto Him in repentance. Verily, my Lord is Most Merciful, Most Loving."

source: قالوا يا شعيب ما نفقه كثيرا مما تقول وإنا لنراك فينا ضعيفا ولولا رهطك لرجمناك وما أنت علينا بعزيز
en: They said: "O Shu'aib! We do not understand much of what you say, and we see you weak (it is said that he was a blind man) among us. Were it not for your family, we should certainly have stoned you and you are not powerful against us."

source: قال يا قوم أرهطي أعز عليكم من الله واتخذتموه وراءكم ظهريا إن ربي بما تعملون محيط
en: He said: "O my people! Is then my family of more weight with you than Allah? And you have cast Him away behind your backs. Verily, my Lord is surrounding all that you do.

source: ويا قوم اعملوا على مكانتكم إني عامل سوف تعلمون من يأتيه عذاب يخزيه ومن هو كاذب وارتقبوا إني معكم رقيب
en: "And O my people! Act according to your ability and way, and I am acting (on my way). You will come to know who it is on whom descends the torment that will cover him with ignominy, and who is a liar! And watch you! Verily, I too am watching with you."

source: ولما جاء أمرنا نجينا شعيبا والذين آمنوا معه برحمة منا وأخذت الذين ظلموا الصيحة فأصبحوا في ديارهم جاثمين
en: And when Our Commandment came, We saved Shu'aib and those who believed with him by a Mercy from Us. And As-Saihah (torment-awful cry) seized the wrong-doers, and they lay (dead), prostrate in their homes.

source: كأن لم يغنوا فيها ألا بعدا لمدين كما بعدت ثمود
en: As if they had never lived there! So away with Madyan (Midian) as away with Thamud! (All these nations were destroyed).

source: ولقد أرسلنا موسى بآياتنا وسلطان مبين
en: And indeed We sent Musa (Moses) with Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and a manifest authority.

source: إلى فرعون وملئه فاتبعوا أمر فرعون وما أمر فرعون برشيد
en: To Fir'aun (Pharaoh) and his chiefs, but they followed the command of Fir'aun (Pharaoh), and the command of Fir'aun (Pharaoh) was no right guide.

source: يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود
en: He will go ahead of his people on the Day of Resurrection, and will lead them into the Fire, and evil indeed is the place to which they are led.

source: وأتبعوا في هذه لعنة ويوم القيامة بئس الرفد المرفود
en: They were pursued by a curse in this (deceiving life of this world) and (so they will be pursued by a curse) on the Day of Resurrection. Evil indeed is the gift gifted [i.e. the curse (in this world) pursued by another curse (in the Hereafter)].

source: ذلك من أنباء القرى نقصه عليك منها قائم وحصيد
en: That is some of the news of the (population of) towns which We relate unto you (O Muhammad صلى الله عليه و سلم); of them, some are (still) standing, and some have been (already) reaped.

source: وما ظلمناهم ولكن ظلموا أنفسهم فما أغنت عنهم آلهتهم التي يدعون من دون الله من شيء لما جاء أمر ربك وما زادوهم غير تتبيب
en: We wronged them not, but they wronged themselves. So their alihah (gods), other than Allah, whom they invoked, profited them naught when there came the Command of your Lord, nor did they add aught to them but destruction.

source: وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد
en: Such is the Seizure of your Lord when He seizes the (population of) the towns while they are doing wrong. Verily, His Seizure is painful, (and) severe .

source: إن في ذلك لآية لمن خاف عذاب الآخرة ذلك يوم مجموع له الناس وذلك يوم مشهود
en: Indeed in that (there) is a sure lesson for those who fear the torment of the Hereafter. That is a Day whereon mankind will be gathered together, and that is a Day when all (the dwellers of the heavens and the earth) will be present.

source: وما نؤخره إلا لأجل معدود
en: And We delay it only for a term (already) fixed.

source: يوم يأت لا تكلم نفس إلا بإذنه فمنهم شقي وسعيد
en: On the Day when it comes, no person shall speak except by His (Allah's) Leave. Some among them will be wretched and (others) blessed.

source: فأما الذين شقوا ففي النار لهم فيها زفير وشهيق
en: As for those who are wretched, they will be in the Fire, sighing in a high and low tone.

source: خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك إن ربك فعال لما يريد
en: They will dwell therein for all the time that the heavens and the earth endure, except as your Lord wills. Verily, your Lord is the Doer of whatsoever He intends (or wills).

source: وأما الذين سعدوا ففي الجنة خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك عطاء غير مجذوذ
en: And those who are blessed, they will be in Paradise, abiding therein for all the time that the heavens and the earth endure, except as your Lord wills: a gift without an end.

source: فلا تك في مرية مما يعبد هؤلاء ما يعبدون إلا كما يعبد آباؤهم من قبل وإنا لموفوهم نصيبهم غير منقوص
en: So be not in doubt (O Muhammad صلى الله عليه و سلم) as to what these people (pagans and polytheists) worship. They worship nothing but what their fathers worshipped before (them). And verily, We shall repay them in full their portion without diminution.

source: ولقد آتينا موسى الكتاب فاختلف فيه ولولا كلمة سبقت من ربك لقضي بينهم وإنهم لفي شك منه مريب
en: Indeed, We gave the Book to Musa (Moses), but differences arose therein, and had it not been for a Word that had gone forth before from your Lord, the case would have been judged between them, and indeed they are in grave doubt concerning it (this Qur'an).

source: وإن كلا لما ليوفينهم ربك أعمالهم إنه بما يعملون خبير
en: And verily, to each of them your Lord will repay their works in full. Surely, He is All-Aware of what they do.

source: فاستقم كما أمرت ومن تاب معك ولا تطغوا إنه بما تعملون بصير
en: So stand (ask Allah to make) you (Muhammad صلى الله عليه و سلم) firm and straight (on the religion of Islamic Monotheism) as you are commanded and those (your companions) who turn in repentance (unto Allah) with you, and transgress not (Allah's Legal Limits). Verily, He is All-Seer of what you do.

source: ولا تركنوا إلى الذين ظلموا فتمسكم النار وما لكم من دون الله من أولياء ثم لا تنصرون
en: And incline not toward those who do wrong, lest the Fire should touch you, and you have no protectors other than Allah, nor you would then be helped.

source: وأقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين
en: And perform As-Salat (Iqamat-as-Salat ), at the two ends of the day and in some hours of the night [i.e. the five compulsory Salat (prayers)]. Verily, the good deeds remove the evil deeds (i.e. small sins). That is a reminder (an advice) for the mindful (those who accept advice).

source: واصبر فإن الله لا يضيع أجر المحسنين
en: And be patient; verily, Allah wastes not the reward of the good-doers.

source: فلولا كان من القرون من قبلكم أولو بقية ينهون عن الفساد في الأرض إلا قليلا ممن أنجينا منهم واتبع الذين ظلموا ما أترفوا فيه وكانوا مجرمين
en: If only there had been among the generations before you persons having wisdom, prohibiting (others) from Al-Fasad (disbelief, polytheism, and all kinds of crimes and sins) in the earth, (but there were none) - except a few of those whom We saved from among them! Those who did wrong pursued the enjoyment of good things of (this worldly) life, and were Mujrimun (criminals, disbelievers in Allah, polytheists, sinners).

source: وما كان ربك ليهلك القرى بظلم وأهلها مصلحون
en: And your Lord would never destroy the towns wrongfully, while their people were right-doers.

source: ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين
en: And if your Lord had so willed, He could surely have made mankind one Ummah [nation or community (following one religion i.e. Islam)] but they will not cease to disagree.

source: إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين
en: Except him on whom your Lord has bestowed His Mercy (the follower of truth - Islamic Monotheism) and for that did He create them. And the Word of your Lord has been fulfilled (i.e. His Saying): "Surely, I shall fill Hell with jinn and men all together."
